Website/app/controllers/map_controller.rb

SELECT  DISTINCT `tweets`.* FROM `tweets`  WHERE (latitude!=0 || longitude!=0) AND (latitude != 0)  ORDER BY id_tweet DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) AS count_all, hashtag AS hashtag FROM `tweets`  WHERE (longitude != 0) AND (latitude != 0) GROUP BY hashtag
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 88300988 LIMIT 1
---
  def index

    @q = Tweet.order('id DESC').where('latitude!=0 || longitude!=0').search(params[:q])
    if params[:limit]
      @tweets = @q.result(distinct: true).page(params[:page]).per(params[:limit])
    else
      @tweets = @q.result(distinct: true).page(params[:page])
    end




    @movel = Tweet.last

    @marca_filtro= Gmaps4rails.build_markers(@movel) do |movel, marker|
      marker.lat  -23.55
      marker.lng  -46.74
    end


    @json = @tweets

    @hash = Gmaps4rails.build_markers(@json) do |json, marker|
      # marker recebe alguns parametros para cada marcador
      user=User.find(json.user_id)