Website/app/controllers/tweet_controller.rb

  def index
    @twit = Tweet.find(params[:id_tweet])
    @user = User.find(@twit.user_id)
---
SELECT  `tweets`.* FROM `tweets`  WHERE `tweets`.`id` = 519136749625544705 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 519136749625544705 LIMIT 1