Website/app/views/tweets/_tweet.html.erb

					<!-- It will show only the geolocalizated tweets!! -->
							<% user = User.find_by_id_user(tweet.id_user) %>
---
SELECT  `User`.* FROM `User`  WHERE `User`.`id_user` = 88300988 LIMIT 1