Website/app/views/tweets/_tweet.html.erb

					<!-- It will show only the geolocalizated tweets!! -->
							<% user = User.find_by(tweet.user_id) %>
---
SELECT  `users`.* FROM `users`  WHERE (88300988) LIMIT 1