Website/app/views/map/_statistics.html.erb

		<title1>Geral</title1>
		<p><b>Quantidade total de tweets:</b> <%= Tweet.all.count %></p>
---
SELECT  `tweets`.* FROM `tweets`   ORDER BY `tweets`.`id` DESC LIMIT 1
SELECT COUNT(*) AS count_all, hashtag AS hashtag FROM `tweets`  WHERE (longitude != 0) AND (latitude != 0) GROUP BY hashtag